In [1]:
from faker import Faker
import random

In [2]:
fake = Faker()

In [3]:
products = []
for i in range(10001, 500000):
    products.append([i, fake.unique.user_name(), random.randint(10000, 50000)])

In [4]:
import pandas as pd

In [5]:
products = pd.DataFrame(products, columns=["id", "name", "price"])
products

            id               name  price
0        10001        turnersarah  28333
1        10002           taylor73  26759
2        10003           vbridges  35111
3        10004       bowensuzanne  39247
4        10005       williamscott  18084
...        ...                ...    ...
489994  499995     waltersantiago  48249
489995  499996        destinyhess  29510
489996  499997     pittmanmelanie  39675
489997  499998  mcintyrechristina  46599
489998  499999         mccannsara  36828

[489999 rows x 3 columns]

In [6]:
products.to_csv("products.csv", index=False)